#Вдохновение – это умение приводить себя в рабочее состояние!
         #=>
#Количество гласных букв равно 25
#Количество согласных букв равно 24

str = input()
x=['а','у','о','ы','и','э','я','ю','ё','е','А','У','О','Ы','И','Э','Я','Ю','Ё','Е']
y=['б','в','г','д','ж','з','й','к','л','м','н','п','р','с','т','ф','х','ц','ч','ш','щ','Б','В','Г','Д','Ж','З', 'Й','К','Л','М','Н','П','Р','С','Т','Ф','Х','Ц','Ч','Ш','Щ']
cnt = 0
cnt1 = 0
for i in str:
    for b in x:
        if i == b:
            cnt += 1
    for c in y:
        if i == c:
            cnt1 += 1
print('Количество гласных букв равно',cnt)
print('Количество согласных букв равно',cnt1)

#2
s = input()
son, cons = 0, 0
for c in s:
    if c in ('ауоыиэяюёеАУОЫИЭЯЮЁЕ'):
        son += 1
    if c in ('бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ'):
        cons += 1
print('Количество гласных букв равно', son)
print('Количество согласных букв равно', cons)

#3
s = input()
sogl = 0
glas = 0
for x in s.lower():
    if x in "бвгджзйклмнпрстфхцчшщ":
        sogl += 1
    if x in "ауоыиэяюёе":
        glas += 1
print("Количество гласных букв равно", glas)
print("Количество согласных букв равно", sogl)

