#1
# Метод capitalize() возвращает копию строки s, в которой первый символ имеет 
# верхний регистр, а все остальные символы имеют нижний регистр.
s = 'foO BaR BAZ quX'
print(s.capitalize())

#Foo bar baz qux

#2
#Метод swapcase() возвращает копию строки s, в которой все символы, 
# имеющие верхний регистр, преобразуются в символы нижнего регистра и наоборот.
s = 'FOO Bar 123 baz qUX'
print(s.swapcase())

#foo bAR 123 BAZ Qux

#3
#Метод title() возвращает копию строки s, в которой первый
#  символ каждого слова переводится в верхний регистр.
s = 'the sun also rises'
print(s.title())

#The Sun Also Rises

#4
